# https://docs.brew.sh/Brew-Bundle-and-Brewfile

tap "go-task/tap"
tap "homebrew/services"
# Software library to render fonts
brew "freetype"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Development kit for the Java programming language
brew "openjdk"
# Flexible lightweight test report tool
brew "allure"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Utility that creates projects from templates
brew "cookiecutter"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool for exploring each layer in a docker image
brew "dive"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Interactive computing in Python
brew "ipython"
# Development kit for the Java programming language
brew "openjdk@21"
# Load testing and performance measurement application
brew "jmeter"
# Image manipulation library
brew "jpeg"
# Open h.265 video codec implementation
brew "libde265"
# Portable Foreign Function Interface library
brew "libffi"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Terminal multiplexer
brew "tmux"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
vscode "codeium.codeium"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shamanu4.django-intellisense"
vscode "sobolevn.pustota"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "zxh404.vscode-proto3"